node {
  name: "Placeholder"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
        dim {
          size: 64
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "random_shuffle_queue"
  op: "RandomShuffleQueue"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 80
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 40
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "random_shuffle_queue_enqueue"
  op: "QueueEnqueue"
  input: "random_shuffle_queue"
  input: "Placeholder"
  input: "Placeholder_1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@random_shuffle_queue"
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "Placeholder_2"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
        dim {
          size: 64
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_3"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "random_shuffle_queue_1"
  op: "RandomShuffleQueue"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 16
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 8
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "random_shuffle_queue_1_enqueue"
  op: "QueueEnqueue"
  input: "random_shuffle_queue_1"
  input: "Placeholder_2"
  input: "Placeholder_3"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@random_shuffle_queue_1"
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "random_shuffle_queue_DequeueMany/n"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 5
      }
    }
  }
}
node {
  name: "random_shuffle_queue_DequeueMany"
  op: "QueueDequeueMany"
  input: "random_shuffle_queue"
  input: "random_shuffle_queue_DequeueMany/n"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 128
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 5
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "random_shuffle_queue_1_DequeueMany/n"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "random_shuffle_queue_1_DequeueMany"
  op: "QueueDequeueMany"
  input: "random_shuffle_queue_1"
  input: "random_shuffle_queue_1_DequeueMany/n"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@random_shuffle_queue_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 128
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\001\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal"
  op: "Add"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/mul"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Assign"
  op: "Assign"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/read"
  op: "Identity"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 1
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 3.99999989895e-05
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Regularizer/l2_regularizer"
  op: "Mul"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Regularizer/l2_regularizer/scale"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/Conv2D"
  op: "Conv2D"
  input: "random_shuffle_queue_DequeueMany"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 126
          }
          dim {
            size: 62
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta/Assign"
  op: "Assign"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta/read"
  op: "Identity"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/Add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/Add"
  op: "Add"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean/read"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/Add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 39060.0
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/Sub"
  op: "Sub"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/Conv2D"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 126
          }
          dim {
            size: 62
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/SquaredDifference"
  op: "SquaredDifference"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/Conv2D"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 126
          }
          dim {
            size: 62
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/mean_ss/reduction_indices"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/mean_ss"
  op: "Sum"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/Sub"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/mean_ss/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/var_ss/reduction_indices"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/var_ss"
  op: "Sum"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/SquaredDifference"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/var_ss/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/divisor"
  op: "Inv"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/Const"
  input: "^g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/mean_ss"
  input: "^g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/var_ss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/shifted_mean"
  op: "Mul"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/mean_ss"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/divisor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/mean"
  op: "Add"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/shifted_mean"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/Mul"
  op: "Mul"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/sufficient_statistics/var_ss"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/divisor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/Square"
  op: "Square"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/shifted_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/variance"
  op: "Sub"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/Mul"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/Square"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg/decay"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.000300000014249
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg/sub"
  op: "Sub"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean/read"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg/mul"
  op: "Mul"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg/sub"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg"
  op: "AssignSub"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg_1/decay"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.000300000014249
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance/read"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg_1/sub"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg_1"
  op: "AssignSub"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000475
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/add"
  op: "Add"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/variance"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/mul"
  op: "Mul"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/Conv2D"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/Rsqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 126
          }
          dim {
            size: 62
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/mul_1"
  op: "Mul"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/moments/normalize/mean"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/Rsqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/sub"
  op: "Sub"
  input: "g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/beta/read"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/add_1"
  op: "Add"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/mul"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 126
          }
          dim {
            size: 62
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/Relu"
  op: "Relu"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/BatchNorm/batchnorm/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 126
          }
          dim {
            size: 62
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/MaxPool_Module_0/MaxPool"
  op: "MaxPool"
  input: "g_embedding_support_vectors/g_embedding_support_vectors/Module_0/Conv2d_Module_0/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 63
          }
          dim {
            size: 31
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
          dim {
            size: 3
          }
          dim {
            size: 64
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "g_embedding_support_vectors/Module_1/Conv2d_Module_1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
